<template>
  <div class="details">
    <div class="container">
      <h2>על מיטל מחשבים</h2>
      <p>
        מיטל מחשבים הינו בית תוכנה. <br/><br/>
        אנו מפתחים אפליקציות עסקיות בסביבת חלונות לחברות המתמחות בסחר רכב.<br/>
        בין לקוחותנו מאות מוסכים, בתחום מכונאות, פחחות, חשמל, מיזוג אוויר ועוד.<br/>
        כנ"ל חנויות לסחר בחלפי רכב, עסקים לתווך ומכירת רכבים, פירוק מכוניות, חברות השכרה, מוסכים לאופנועים ועוד.<br/>
        כמו כן חברות שאינן קשורות לענף הרכב כגון קבלני בניין, משווקי כלי עבודה ואינסטלציה, אירועים, בתי תוכנה, בתי מלאכה לשיפוץ ועוד.
      </p>
      <!-- <p>
        תוכנת מיטל מתמחה בגמישות. המשתמש יכול להתאים את התוכנה לצרכיו.<br/>
        ניתן לקבוע את פורמט המסמכים, לשנות שדות כותרת , מבנה טורים משתתפים,<br/>
         ניתן לעצב את פורמט ההדפסה לנייר של המסמכים ואת מבנה הדוחות.<br/>
        מערכת פרמטרים חכמה מאפשרת לעצב את מימדי החלונות, ולהגיע לתצוגה עשירה ויזואלית בשלל סגנונות גוונים וגופנים.<br/><br/>
        מיטל מתאפיינת בנוחות בעבודה. לחצני עכבר ידידותיים, חלונות חיפוש ועזרה לאיתור מידע דרוש,<br/>
        מסכים מעוצבים נוחים לצפייה, ריכוזיות מידע למסך הנוכחי.<br/><br/>
        קישוריות לתוכנות הנהלת חשבונות נפוצות בשוק, למוצרי Microsoft Office ולמוצרים נוספים של מערכת הפעלה חלונות<br/>
        המותקנים במחשב תמיכה בכל סוגי המדפסות בשוק בכל מערכות ההפעלה חלונות למעט חלונות 95<br/>
      </p> -->
    </div>
  </div>
</template>

<script>

export default {
  name: 'Details',
  components: {
  }

  // props: {
  //   msg: String
  // }
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
.details {
  display: flex;
  align-items: center;
  padding: 3% 0;
  min-height: 50vh;
  /* background: #eefff6; */
  background: linear-gradient(180deg, rgba(255,255,255,1) 0%, rgb(224, 224, 224) 100%);
}

p {
  margin: 2% 0;
  padding: 1% 3%;
}
</style>
