<template>
  <div class="specs">
    <div class="container">
      <h2>מפרט טכני</h2>
      <p>המפרט הטכני תקף בכל מוצרי התוכנה שלנו</p>
      <div class="spec">
        <img src="../assets/png/invoice.png" alt="invoice">
        <h4>מערכת שווק</h4>
        <p>ניהול כרטסת לקוחות, הפקת חשבוניות מס בהקפה,חשבוניות מס קבלה, ת.משלוח ועוד.<br />
          אפשרות לריכוז אוטומטי/ידני של ת.משלוח ו/או כרטיסי עבודה לחשבוניות מרכזות סוף חודש.<br />
          בחשבונית המרכזת אופצייה לפרט/לא לפרט את רכיבי המסמכים שבה.<br />
          תמיכה בהזמנות ובהצעות מחיר ואפשרות סגירתן כאסמכתא ל-ת.משלוח או לחשבונית מס.<br />
          לכל מסמך פורמט עיצוב משלו ומבנה הדפסה הניתן להגדרה ולשינוי.<br />
          מעקב אחרי הלקוח מזוויות רבות, התפלגות שנתית, תצוגה גרפית, היסטוריה של לקוח ניהול וניתוח יתרה.
        </p>
      </div>
      <div class="spec">
        <img src="../assets/png/inventory.png" alt="inventory">
        <h4>מערכת רכש</h4>
        <p>כרטסת ספקים, הפקת תעודות כניסה וחשבוניות ספקים. איתור מחיר קניה נמוך ו/או אחרון.<br />
          ניתוב הקנייה/ההוצאה לרכיב ההוצאות המתאים,תמיכה בקניות פטורות מעמ.<br />
          הקמת פריט או רכיב מלאי בזמן הקלדת חשבונית ספק.<br />
          אפשרות להקלדת ת.משלוח ספקים וריכוז לחשבונית ספק תוך בקרה בסוף חודש.
        </p>
      </div>
      <div class="spec">
        <img src="../assets/png/cashbox.png" alt="cashbox">
        <h4>כספים וקופה</h4>
        <p>שיקים נכנסים, שיקים יוצאים לספקים. קבלות, תשלומים לספקים, הפקדות לבנקים ספר קופה תזרים מזומנים,<br />
          דוח מעקב אובליגו ודוחות שיקים דחויים. איתור שיק לפי מגוון מאפיינים. טיפול בשיקים חוזרים ובטופס הוצאה
          מהקופה.<br />
          ניהול מס רב של כרטיסי קופה ו/או כרטיסי בנק.</p>
      </div>
      <div class="spec">
        <img src="../assets/png/windows.png" alt="windows">
        <h4>קישוריות</h4>
        <p>לתוכנות הנהלת חשבונות נפוצות בשוק, למוצרי Microsoft Office ולמוצרים נוספים
          של מערכת הפעלה חלונות המותקנים במחשב.</p>
      </div>
      <div class="spec">
        <img src="../assets/png/admin-panel.png" alt="admin-panel">
        <h4>התאמות</h4>
        <p>התאמות כרטיסים והתאמת בנק נוחה וחכמה לתיפעול.ההתאמה ידנית ו/או אוטומטית.תמיכה ביצירת פעולות יומן מתוך מסך
          ההתאמה.</p>
      </div>
      <div class="spec">
        <img src="../assets/png/forklift.png" alt="forklift">
        <h4>ניהול מלאי</h4>
        <p>ניהול כרטסת מלאי שאינה מוגבלת במימדיה. מערכת מעקב יתרות. דוחות מעקב התפלגות פריט חודשית ושנתית, דוח רווח
          לפריט,<br />
          דוח רווח והפסד והתפלגות שנתית של פריט, השוואת מחיר קנייה/מכירה דוחות מלאי לרכיבים מומלצים להזמנה.
        </p>
      </div>
      <div class="spec">
        <img src="../assets/png/report.png" alt="report">
        <h4>מערכת דוחות</h4>
        <p>דוחות מעקב ודוחות סטטיסטיים כספיים גמישים וניתנים לעיצוב. מגוון דוחות גבייה ודוחות ריכוזי מידע לגבי התנהלות
          העסק.<br />
          הדוחות ניתנים לייצוא לגליונות אלקטרוניים ולמעבדי תמלילים גרפיים המותקנים במחשב.
        </p>
      </div>
      <div class="spec">
        <img src="../assets/png/market-research.png" alt="market-research">
        <h4>תצוגה גרפית</h4>
        <p>גרף רווח הפסד בתלת מימד, הצגה גרפית של לקוחות, ספקים ו-או כל רכיב חשבונאי אחר במערכת הנהת החשבונות.<br />
          התצוגה הגרפית במגוון אפשרויות תצוגה ואפשרות ייצוא לכלי גרפיקה ממחושבים במערכת ראה צילומי מסכים וגרפים לדוגמה.
        </p>
      </div>
      <div class="spec">
        <img src="../assets/png/search.png" alt="search">
        <h4>מערכת שאילתות</h4>
        <p>מערכת לאיתור נתונים מהירה כולל מנועי חיפוש טקסט לאיתור מהיר של פריט/לקוח/ספק/מסמך/קבלה ועוד.<br />
          תמיכה בחתך דמיון פונטי ובמגוון חתכים נוספים המסייעים לאיתור מהיר. חלונות הדפדוף יבואו לעזרה בכל מקום בו יש
          צורך לאתר רכיב
          במערכת.<br />
          מתוך חלון הדפדוף ניתן לקבל מידע נוסף לגבי הרכיב שאותר. שימוש אינטנסיבי בלחיצה-כפולה עם העכבר להצגת אסמכתאות
          כגון עותק מסמך מתוך שאילה או דף תנועות.
        </p>
      </div>
      <div class="spec">
        <img src="../assets/png/illustration.png" alt="illustration">
        <h4>מערכת התכתבות</h4>
        <p>מעבד תמלילים גרפי אינטגרלי פנימי המשמש בין השאר לעיצוב קובץ הלוגו של החברה.<br />
          שילוב גופנים מעוצבים סגנונות וגוונים + תמיכה בדוור לפי כרטסת לקוחות ספקים והדפסת מדבקות.<br />
          כמו כן משמש מעבד התמלילים להקלדת טקסט נסתר לגבי לקוח, ספק, מסמך או פריט מלאי במערכת.
        </p>
      </div>
      <div class="spec">
        <img src="../assets/png/ebook.png" alt="ebook">
        <h4>מערכת הנה"ח</h4>
        <p>מערכת הנהח בנוייה של התוכנה.<br />
          ריבוי כרטיסי הכנסות וכרטיסי קניות/הוצאות. דוחות מאזניים, דוח מקדמות ודוח מעמ. מאזן בוחן, דוח רווח והפסד.<br />
          אפשרות ליצירת תנועות יומן בשיטה מקוצרת או מורחבת, כולל תמיכה בניהול סוגי תנועה לפעולות הנהח מורכבות,<br />
          ניהול מנה זמנית עם אפשרות סגירה למאגר הקבוע. דוח ניכוי במקור ללקוחות/לספקים, כרטסת הנהח,
          רציפות אסמכתאות ועוד.</p>
      </div>
      <div class="spec">
        <img src="../assets/png/export.png" alt="export">
        <h4>מערכת ייצוא נתונים</h4>
        <p>האפשרות לייצא כל דוח / טבלה / גרף במערכת לגליונות אלקטרוניים ו/או למוצרי מייקרוסופט.<br />
          תמיכה בהעתקת נתונים ללוח, תמיכה בייצוא קובץ תנועות יומן לתוכנות הנהח נפוצות בשוק כגון מנהל חשבשבת
          ופיננסית.<br />
          כמו כן תוכניות שירות לייבוא נתונים כמו מחירון חלפים מקבצים חיצוניים או מגליונות אלקטרוניים.
        </p>
      </div>
      <div class="spec">
        <img src="../assets/png/flexibility.png" alt="flexibility">
        <h4>גמישות בעבודה</h4>
        <p>מערכת פרמטרים חכמה המאפשרת גמישות רבה והתאמת התוכנה לדרישות הלקוח. האפשרות לבחור בגופני מסך או מדפסת
          ובצבעים.<br />
          הגדרת מבנה מסמכים גמישה המאפשרת למשתמש לעצב את המסמכים לדרישותיו. התאמת הדפסה, כותרות, שוליים וצפיפות בין
          שורות ועוד.
        </p>
      </div>
      <div class="spec">
        <img src="../assets/png/idea.png" alt="idea">
        <h4>טיפים</h4>
        <p>האפשרות לחייג ללקוח/לספק דרך מודם.<br />
          האפשרות לחיבור מהיר לכתובת אינטרנט או לאתר בית של לקוחות וספקים.<br />
          תמיכה בשליחה של מסמכים ודוחות לאימייל או בפקס.<br />
          עיצוב לוגו גרפי צבעוני אופציה לשילוב קובץ תמונה בלוגו.<br />
          אלפון טלפונים מהיר וידידותי.
        </p>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: 'Specs',
  // props: {
  //   msg: String
  // }
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
.specs {
  padding: 5% 0;
  background: #f8f8f8;
  /* text-align: center; */
}

.spec {
  display: flex;
  margin: 10% 0;
  width: 80%;
}

p {
  padding: 1% 0;
}

.spec p {
  padding: 3% 3%;
  flex-grow: 1;
}

a {
  margin: 3% 0;
  color: inherit;
}

img {
  height: 150px;
  width: 150px;
}


@media only screen and (max-width: 1200px) {
  .spec {
    flex-direction: column;
    width: 90%;

    /* justify-content: space-around; */
  }
}

@media only screen and (max-width: 450px) {
  .container{
    display: flex;
    flex-direction: column;
    align-items: center;
  }

  img{
    display: block;
    margin: 10% auto;
  }
}
</style>
